Revit 2024 API
Alignment Class
 Represents an object which provides access to an underlying Revit alignment element.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public class Alignment
Visual Basic
Public Class Alignment
Visual C++
public ref class Alignment
Remarks
 The element is a DirectShape. The element's category is OST_Alignments.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.Alignment
See Also
Alignment Members
Autodesk.Revit.DB.Infrastructure Namespace